<?xml version="1.0" encoding="unicode" standalone="yes"?>
<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>أدخل الاسم هنا</displayName>
  <description>أدخل الوصف هنا</description>
  <resources>
    <stringTable>
      <string id="Search">بحث</string>
      <string id="WindowsComponents">مكونات Windows</string>
      <string id="VistaOnly">نظام التشغيل Microsoft Windows Vista أو أحدث</string>
      <string id="VistaOrRedist">نظام التشغيل Microsoft Windows Vista أو أي إصدار من Windows يحتوي على الإصدار Windows Search 3.01 أو على إصدار أحدث</string>
      <string id="RedistOnly">نظام التشغيل Microsoft Windows XP أو Windows Server 2003 يحتوي على الإصدارWindows Search 3.01 أو على إصدار أحدث</string>
      <string id="RedistOnly4OrLater">نظام التشغيل Microsoft Windows XP أو Windows Server 2003 يحتوي على الإصدار Windows Search 4.0 أو على إصدار أحدث</string>
      <string id="301OrLater">نظام التشغيل Microsoft Windows XP وWindows Server 2003 يحتوي على الإصدار Windows Search 3.01 أو أي إصدار من Microsoft Windows يحتوي على الإصدار Windows Search 4.0 أو على إصدار أحدث</string>
      <string id="301To4">Microsoft Windows XP أو Windows Server 2003 المزود بالإصدار 3.01 من Windows Search أو أي إصدار من Microsoft Windows المزود بـ Windows Search 4.0</string>
      <string id="4OrLater">أي إصدار من Microsoft Windows يحتوي على الإصدار Windows Search 4.0 أو على أحدث</string>
      <string id="VistaOr4">نظام التشغيل Microsoft Windows Vista أو أي إصدار من Windows يحتوي على الإصدار Windows Search 4.0 أو على إصدار أحدث</string>
      <string id="VistaWith4">نظام التشغيل Microsoft Windows Vista يحتوي على الإصدار Windows Search 4.0 أو على إصدار أحدث</string>
      <string id="AllowUsingDiacritics">السماح باستخدام علامات التشكيل</string>
      <string id="Win7Only">Microsoft Windows 7 أو الأحدث</string>
      <string id="WS4Only">أي إصدار من Microsoft Windows مزود بـ Windows Search 4.0 </string>
      <string id="ExplainAllowUsingDiacritics">يتيح إعداد النهج هذا للكلمات التي تحتوي على الحروف المشكّلة أن تعامل ككلمات منفصلة. في حالة تمكينه، يتم معاملة الكلمات التي تختلف في علامات التشكيل فقط على أنها كلمات مختلفة. وفي حالة تعطيله، ستعامل الكلمات المشكـَّلة والغير مشكـَّلة ككلمات متطابقة. لم يتم تكوين إعداد النهج هذا افتراضيًا. إذا لم تقم بتكوين إعداد النهج هذا، سيتم استخدام الإعداد المحلي الذي تم تكوينه من خلال لوحة التحكم. ملاحظة: افتراضيًا، يتم تعيين إعداد لوحة التحكم لتتعامل مع الكلمات المختلفة فقط بسبب علامات التشكيل على أنها نفس الكلمات.</string>
      <string id="AutoIndexSharedFolders">منع إضافة مجلدات المشاركة إلى الفهرس تلقائيًا</string>
      <string id="ExplainAutoIndexSharedFolders">قم بتمكين هذا النهج لمنع Windows Search من إضافة مجلدات المشاركة إلى الفهرس تلقائيًا. في حالة التمكين، لن يقوم Windows Search بإضافة المشاركات التي تم إنشاؤها على جهاز الكمبيوتر إلى نطاق الفهرس. وإذا لم يتم تكوينه أو تم تعطيله، سيقوم Windows Search بمراقبة مجلدات المشاركة وغير المشاركة على جهاز الكمبيوتر إلى جانب إضافتها إلى الفهرس أو إزالتها منه.</string>
      <string id="FavoriteLocations">منع إضافة مواقع محددة من قبل لمستخدم إلى القائمة "كافة المواقع"</string>
      <string id="ExplainFavoriteLocations">يتيح إعداد النهج هذا لك إمكانية تمكين خيارات موقع "إضافة/إزالة" أو تعطيله في القائمة "كافة المواقع" بالإضافة إلى أية مواقع محددة التي أنشأها أحد المستخدمين. عندما لا يتم تكوين هذا النهج، يكون السلوك الافتراضي هو السماح للمستخدمين بإضافة مواقع جديدة وإزالتها إلى قائمة المواقع. عندما يتم تمكين النهج، لن تكون خيارات مواقع "الإضافة" و"الإزالة" وأية مواقع محددة من قبل المستخدم في السابق مرئية. عندما يتم تعطيل النهج، ستكون كل من خيارات مواقع "الإضافة" و"الإزالة" وأية مواقع محددة من قبل المستخدم مرئية.</string>
      <string id="PreventUsingAdvancedIndexingOptions">منع عرض خيارات الفهرسة المتقدمة في "لوحة التحكم"</string>
      <string id="ExplainPreventUsingAdvancedIndexingOptions">في حالة التمكين لا تسمح "خيارات البحث والفهرسة" في لوحة التحكم بفتح مربع الحوار "خيارات متقدمة". وبخلاف ذلك، يمكن فتحها. الإعداد الافتراضي هو التعطيل.</string>
      <string id="HideUNCTab">منع إضافة مواقع UNC إلى الفهرس من لوحة التحكم</string>
      <string id="ExplainHideUNCTab">يمنع تمكين هذا النهج المستخدمين من إضافة مواقع UNC إلى الفهرس من "خيارات البحث والفهرسة" في لوحة التحكم. لن تتم إزالة أية مواقع UNC تم بالفعل إضافتها إلى الفهرس بواسطة المستخدم.

عندما يتم تعطيل هذا النهج أو عدم تكوينه، سيتمكن المستخدمون من إضافة مواقع UNC إلى الفهرس.

ليس لهذا النهج تأثير إذا كانت الوظيفة الإضافية Files on Microsoft Networks غير مثبتة.

الإعداد الافتراضي هو التعطيل.</string>
      <string id="PreventModifyingIndexedLocations">منع تخصيص المواقع المفهرسة في "لوحة التحكم"</string>
      <string id="ExplainPreventModifyingIndexedLocations">في حالة التمكين لا تسمح "خيارات البحث والفهرسة" في لوحة التحكم بفتح مربع الحوار "تعديل المواقع". وبخلاف ذلك، يمكن فتحها. الإعداد الافتراضي هو التعطيل.</string>
      <string id="AllowIndexingEncryptedStoresOrItems">السماح بفهرسة الملفات المشفرة</string>
      <string id="ExplainAllowIndexingEncryptedStoresOrItems">يتيح إعداد النهج هذا إمكانية فهرسة العناصر المشفّرة. إذا قمت بتمكين إعداد النهج هذا، ستحاول الفهرسة فك تشفير المحتوى وفهرسته (وستظل قيود الوصول مطبقة). وفي حالة تعطيل إعداد النهج هذا، ستظل مكونات خدمة البحث (بما في ذلك المكونات التي لا تنتمي إلى شركة Microsoft) لا تقوم بفهرسة العناصر المشفّرة أو المخازن المشفّرة. لم يتم تكوين إعداد هذا النهج بشكل افتراضي. إذا لم تقم بتكوين إعداد هذا النهج، سيتم استخدام الإعداد المحلي الذي تم تكوينه عن طريق "لوحة التحكم". لقد تم فهرسة تعيين إعداد "لوحة التحكم" إلى عدم فهرسة المحتوى المشفّر بشكلٍ افتراضي. 

 في حالة تمكين هذا الإعداد أو تعطيله، تتم إعادة إنشاء الفهرس بالكامل. 

يجب استخدام تشفير وحدة التخزين بالكامل (مثل تشفير المحركات باستخدام BitLocker أو أحد الحلول خلاف حلول Microsoft) على موقع الفهرس للحفاظ على أمان ملفات التشفير.</string>
      <string id="PreventIndexOnBattery">منع الفهرسة عند التشغيل على طاقة البطارية لتوفير الطاقة</string>
      <string id="ExplainPreventIndexOnBattery">في حالة التمكين، يتوقف المفهرس مؤقتًا وذلك في حالة تشغيل الكمبيوتر على البطارية. وفي حالة التعطيل، تتبع الفهرسة السلوك الافتراضي. الإعداد الافتراضي هو التعطيل.</string>
      <string id="PreventRemoteQueries">منع العملاء من الاستعلام عن الفهرس عن بعد</string>
      <string id="ExplainPreventRemoteQueries">في حالة التمكين، لا يستطيع العملاء الاستعلام عن فهرس الكمبيوتر هذا عن بعد. ولذلك، عندما يقوم العملاء باستعراض مشاركات الشبكة التي تم تخزينها على هذا الكمبيوتر، فلن يتم البحث عنها باستخدام الفهرس. وفي حالة التعطيل، ستستخدم طلبات بحث العميل الفهرس الخاص بهذا الكمبيوتر. الإعداد الافتراضي هو التعطيل.</string>
      <string id="DisableBackoff">تعطيل مهلة المفهرس</string>
      <string id="ExplainDisableBackoff">في حالة التمكين، سيتم تعطيل ميزة مهلة مفهرس البحث. وسوف تستمر الفهرسة بأقصى سرعة حتى في حالة كون نشاط النظام عاليًا. وفي حالة التعطيل، سيتم استخدام منطق المهلة لتقليل سرعة نشاط الفهرسة إذا كان نشاط النظام عاليًا. الإعداد الافتراضي هو التعطيل.</string>
      <string id="PreventIndexingOfflineFiles">منع فهرسة الملفات في ذاكرة التخزين المؤقت للملفات غير المتصلة  </string>
      <string id="ExplainPreventIndexingOfflineFiles">في حالة التمكين، لن تتم فهرسة الملفات الموجودة على مشاركات الشبكات التي تم توفيرها دون اتصال. وبخلاف ذلك تتم فهرستها. الإعداد الافتراضي هو التعطيل.</string>
      <string id="EnableIndexingUncachedExchangeFolders">تمكين فهرسة مجلدات Exchange غير المخزنة مؤقتًا</string>
      <string id="ExplainEnableIndexingUncachedExchangeFolders">يتيح تمكين هذا النهج إمكانية فهرسة عناصر البريد الموجودة على خادم Microsoft Exchange عند عدم تشغيل Microsoft Outlook في الوضع المخزن. يتمثل السلوك الافتراضي للبحث في عدم فهرسة مجلدات Exchange غير المخزنة. سيؤدي تعطيل هذا النهج إلى حظر أي فهرسة لمجلدات Exchange غير المخزنة. تُدار علب بريد المفوضين على حدة من خلال علب البريد الموجودة على الإنترنت. لا يؤثر الإعداد "تعطيل فهرسة مجلدات Exchange غير المخزنة" على علب بريد المفوضين. لإيقاف فهرسة علب البريد الموجودة على الإنترنت وعلب بريد المفوضين، يجب تعطيل كلا النهجين.</string>
      <string id="EnableIndexingDelegateMailboxes">تمكين فهرسة علب بريد المفوضين في حالة الاتصال</string>
      <string id="ExplainEnableIndexingDelegateMailboxes">يتيح تمكين هذا النهج إمكانية فهرسة عناصر علب بريد المفوضين في حالة الاتصال والموجودة على خادم Microsoft Exchange. ويؤثر هذا النهج على علب بريد المفوضين في حالة الاتصال فقط. ويتيح Microsoft Outlook 2007 للمستخدمين إمكانية تخزين أجزاء من علب بريد المفوضين محليًا (على سبيل المثال، جهات الاتصال أو التقويم). لن يؤثر هذا النهج على أجزاء علبة بريد المفوض التي تم تخزينها محليًا. ولتمكين هذا النهج من التأثير على كافة أجزاء علبة بريد المفوض، ويجب التأكد بالنسبة لبرنامج Microsoft Outlook 2007 من عدم تخزين أي جزء من أجزاء علبة بريد المفوض محليًا. ويتمثل السلوك الافتراضي للبحث في عدم فهرسة علب بريد المفوضين في حالة الاتصال. تُدار علب بريد المفوض في حالة الاتصال بشكل منفصل عن علب البريد في حالة الاتصال. ليس للنهج " تعطيل فهرسة مجلدات Exchange غير المخزنة" أي تأثير على علب بريد المفوضين في حالة الاتصال. لإيقاف فهرسة علب البريد في حالة الاتصال وعلب بريد المفوضين في حالة الاتصال، يجب تعطيل كلا النهجين.</string>
      <string id="EnableThrottlingOnlineMailboxes">تمكين السرعة لفهرسة البريد في حالة الاتصال</string>
      <string id="ExplainEnableThrottlingOnlineMailboxes">في حالة استخدام Microsoft Office Outlook في وضع الاتصال، يمكنك تمكين هذا النهج للتحكم في مدى سرعة فهرسة البريد في حالة الاتصال والموجود على خادم Microsoft Exchange. كلما قل معدل تعيين هذا النهج، قل العبء الذي سيحدث على خادم Microsoft Exchange المستخدم. تقدر القيمة الافتراضية لهذا النهج بـ 120 عنصرًا في الدقيقة. لتقليل العبء على خوادم Microsoft Exchange، يجب تقليل معدل العناصر التي يتم فهرستها في الدقيقة. في حالة تعطيل هذا النهج، سيتم فهرسة عناصر البريد في حالة الاتصال بمعدل السرعة التي يدعمها خادم Microsoft Exchange. وفي حالة تعيين هذا النهج إلى غير مكون، فسيتم فهرسة عناصر البريد في حالة الاتصال بسرعة 120 عنصرًا في الدقيقة. ليس لهذا النهج أي تأثير على عناصر البريد عند استخدام Microsoft Office Outlook في وضع التخزين.</string>
      <string id="LimitEnableThrottlingOnlineMailboxes">عدد العناصر في الدقيقة</string>
      <string id="PreventIndexingOutlook">منع فهرسة Microsoft Office Outlook</string>
      <string id="ExplainPreventIndexingOutlook">قم بتمكين إعداد النهج هذا لمنع فهرسة أي من عناصر Microsoft Outlook. الإعداد الافتراضي هو فهرسة عناصر Outlook تلقائيًا. في حالة تمكين هذا النهج، فلن يمكن بعد ذلك إضافة عناصر Outlook الخاصة بالمستخدم إلى الفهرس ولن يراها المستخدم في نتائج البحث.</string>
      <string id="PreventIndexingEmailAttachments">منع فهرسة مرفقات البريد الإلكتروني</string>
      <string id="ExplainPreventIndexingEmailAttachments">قم بتمكين إعداد النهج هذا لمنع فهرسة محتوى مرفقات البريد الإلكتروني. في حالة التمكين، لا تقوم مكونات خدمة الفهرسة (بما في ذلك المكونات خلاف مكونات Microsoft) بفهرسة مرفقات البريد الإلكتروني. يجب عليك الأخذ في الاعتبار القيام بتمكين هذا النهج إذا كنت مهتمًا بأمان الفهرسة أو أدائها على عوامل تصفية (iFilters) المستندات الخاصة بجهات خلاف Microsoft. يتم تعطيل هذا النهج بشكل افتراضي.</string>
      <string id="PreventIndexingPublicFolders">منع فهرسة المجلدات العامة</string>
      <string id="ExplainPreventIndexingPublicFolders">قم بتمكين هذا النهج لمنع فهرسة المجلدات العامة الموجودة في Microsoft Office Outlook. عند تعطيل هذا النهج أو عدم تكوينه يمكن للمستخدم استخدام خيار فهرسة المجلدات العامة المخزنة في Outlook. تتم فهرسة المجلدات العامة فقط عند استخدام إصدار Outlook 2003 أو إصدار أحدث. يجب على المستخدم التشغيل في الوضع المخزن ويجب تشغيل الخيار "تنزيل مفضلة المجلدات العامة".</string>
      <string id="PreventIndexingCertainPaths">منع فهرسة مسارات معينة</string>
      <string id="PreventIndexingCertainPaths_Explain">في حالة تمكين إعداد النهج هذا، يتم تحديد إحدى قوائم المسارات لاستثنائها من الفهرسة. لا يتمكن المستخدم من إدخال أي مسار من المسارات التي تبدأ بأحد المسارات التي قمت بتحديدها. 

إذا قمت بتمكين إعداد النهج هذا ثم تعطيله، فيمكن للمستخدمين فهرسة أي مسار غير مقيد من قبل النُهُج الأخرى علمًا أنه لن يمكن استعادة قائمة المسارات الأصلية الخاصة بهم إلى الفهرس.
      </string>
      <string id="PreventIndexingCertainPaths_User_Explain">في حالة تمكين إعداد النهج هذا، يتم تحديد قائمة من المسارات لاستبعادها من الفهرسة. ولا يمكن للمستخدم إدخال أي مسار يبدأ بأحد هذه المسارات التي قمت بتحديدها. وعلى أساس لكل مستخدم، يعمل إعداد النهج هذا فقط إذا تم تحديد معالج بروتوكول يشير إلى نطاق مستخدم يستند إلى SID، مثل MAPI. ولا يتم استبعاد مسارات نظام الملف التي لا تشير إلى SID محدد من الفهرسة إذا تم تحديدها فقط في "نهج المجموعة" ضمن "تكوين المستخدم". لتقييد مسار نظام ملف من الفهرسة، الرجاء تحديد مسار نظام الملف حتى تتم فهرسته ضمن "نهج المجموعة" الخاص بـ "تكوين الكمبيوتر".

في حالة تمكين إعداد النهج هذا ثم تعطيله، يمكن للمستخدمين فهرسة أي مسار غير مقيد بواسطة النهج الأخرى، لكن لا يتم تخزين القائمة الأصلية للمسارات المطلوب فهرستها الخاصة بهم.
      </string>
      <string id="DefaultIndexedPaths">مسارات مفهرسة افتراضيًَا</string>
      <string id="DefaultIndexedPaths_Explain">يسمح تمكين هذا النهج بإمكانية تحديد قائمة مسارات لفهرستها افتراضيًا. قد يتجاوز المستخدم هذه المسارات ويقوم باستثنائها من الفهرسة.</string>
      <string id="DefaultIndexedPaths_User_Explain">يسمح تمكين هذا النهج بإمكانية تحديد قائمة مسارات لفهرستها افتراضيًا. قد يتجاوز المستخدم هذه المسارات ويقوم باستثنائها من الفهرسة. على أساس لكل مستخدم، يعمل إعداد النهج هذا فقط إذا تم تحديد معالج بروتوكول يشير إلى نطاق مستخدم يستند إلى SID، مثل MAPI. ولا يتم تضمين مسارات نظام الملف التي لا تشير إلى SID محدد من أجل الفهرسة إذا تم تحديدها فقط في "نهج المجموعة" ضمن "تكوين المستخدم". لتضمين مسار نظام ملف من أجل الفهرسة، الرجاء تحديد مسار نظام الملف حتى تتم فهرسته ضمن "نهج المجموعة" الخاص بـ "تكوين الكمبيوتر".</string>
      <string id="DefaultExcludedPaths">مسارات مستثناة افتراضيًا</string>
      <string id="DefaultExcludedPaths_Explain">يسمح تمكين هذا النهج بتحديد قائمة مسارات لاستثنائها من الفهرسة افتراضيًا. قد يتجاوز المستخدم هذه المسارات ويقوم بتضمينها في الفهرسة.</string>
      <string id="DefaultExcludedPaths_User_Explain">يسمح تمكين النهج هذا بإمكانية تحديد قائمة مسارات لاستبعادها من الفهرسة افتراضيًا. قد يتجاوز المستخدم هذه المسارات ويقوم بتضمينها في الفهرسة. وعلى أساس لكل مستخدم، يعمل إعداد النهج هذا فقط إذا تم تحديد معالج بروتوكول يشير إلى نطاق مستخدم يستند إلى SID، مثل MAPI. ولا يتم استبعاد مسارات نظام الملف التي لا تشير إلى SID محدد من الفهرسة إذا تم تحديدها فقط في "نهج المجموعة" ضمن "تكوين المستخدم". لتقييد مسار نظام ملف من الفهرسة، الرجاء تحديد مسار نظام الملف حتى تتم فهرسته ضمن "نهج المجموعة" الخاص بـ "تكوين الكمبيوتر".</string>
      <string id="DataDirectory">موقع بيانات المفهرس</string>
      <string id="ExplainDataDirectory">تخزين قاعدة بيانات المفهرس في هذا الدليل. يجب أن يتواجد هذا الدليل على محرك أقراص محلي ثابت.</string>
      <string id="PartDataDirectory">مسار (تحت 128 حرفًا):</string>
      <string id="AddPrimaryIntranetSearchScope">إضافة موقع بحث إنترانت رئيسي</string>
      <string id="AddPrimaryIntranetSearchScope_Explain">يسمح تمكين هذا النهج بإضافة موقع بحث إنترانت رئيسي من خلال Windows Desktop Search. يجب أن تكون قيمة النص: 

الاسم، عنوان url

على سبيل المثال: 

إنترانت،http://intranetsearch.aspx?k=$w 

ويلزم توفير ما يلي: 
1) اسم النطاق مثل "إنترانت".
2) عنوان URL للوصول إلى خدمة البحث. قم باستخدام $w بدلاً من مصطلح الاستعلام الخاص بعنوان URL لخدمة البحث. 

إذا كانت خدمة بحث الإنترانت الخاصة بك هي SharePoint Portal Server، يجب أن يكون الاستعلام مماثلاً للتالي: 
http://sitename/Search.aspx?k=$w

إذا كانت خدمة بحث الإنترانت الخاصة بك هي Windows SharePoint Services (WSS)، يجب أن يكون الاستعلام مماثلاً للتالي، حيث يمثل XXXX معرّف اللغة لخدمة WSS. على سبيل المثال، معرف اللغة الإنجليزية هو 1025. 
http://sitename/_layouts/XXXX/searchresults.aspx?SearchString=$w

يقوم هذا بإضافة موقع بحث إنترانت إلى ما يلي: 
1) Windows Deskbar
2) مربع البحث الذي يعرض نتائج البحث في سطح المكتب
3) مربع بحث WDS في "رفيق البحث"
</string>
      <string id="PrimaryIntranetSearchScopeUrl">عنوان Url لنطاق بحث الإنترانت</string>
      <string id="AddSecondaryIntranetSearchScope">إضافة مواقع بحث إنترانت ثانوية</string>
      <string id="AddSecondaryIntranetSearchScope_Explain">يسمح تمكين هذا النهج بإضافة مواقع بحث إنترانت ثانوية بالإضافة إلى موقع بحث الإنترانت الرئيسي الذي تم تعريفه في نهج "موقع بحث إنترانت رئيسي". يجب أن تكون قيمة النص: 

الاسم1، عنوان url1؛ الاسم2، عنوان url2؛...إلخ

على سبيل المثال:

MySearch,http://mysearch.aspx?q=$w;MySearch2,http://mysearch2?q=$w.

يجب توفر ما يلي لكل نطاق:
1) اسم النطاق مثل "ويب تكنولوجيا معلومات".
2) عنوان URL للوصول إلى خدمة البحث. قم باستخدام $w بدلاً من مصطلح الاستعلام الخاص بعنوان URL لخدمة البحث.

 إذا كانت خدمة بحث الإنترانت الخاصة بك هي SharePoint Portal Server، يجب أن يكون الاستعلام مماثلاً للتالي: 
http://sitename/Search.aspx?k=$w

 إذا كانت خدمة بحث الإنترانت الخاصة بك هي Windows SharePoint Services (WSS)، يجب أن يكون الاستعلام مماثلاً للتالي، حيث يمثل XXXX معرف اللغة لخدمة WSS. على سبيل المثال، معرف اللغة الإنجليزية هو 1025.
http://sitename/_layouts/XXXX/searchresults.aspx?SearchString=$w

تتم إضافة مواقع بحث الإنترانت الإضافية هذه إلى قائمة كافة المواقع في نتائج "البحث في سطح المكتب".</string>
      <string id="SecondaryIntranetSearchScopeUrl">عنوان Url لنطاق بحث الإنترانت</string>
      <string id="PreviewPaneLocation">موقع جزء المعاينة</string>
      <string id="PreviewPaneLocation_Explain">يسمح تمكين هذا النهج بتعيين موقع جزء المعاينة في نتائج "البحث في سطح المكتب". كما يمكنك إيقاف تشغيل جزء المعاينة. الخيارات الأربعة هي:

- تلقائي
- يمين
- أسفل
- مغلق

يجب مراعاة تمكين هذا النهج لإيقاف تشغيل جزء المعاينة إذا كانت البيئة الخاصة بك لا تدعم Office XP أو الإصدارات الأحدث. وتتوفر وظيفة جزء المعاينة كاملة فقط لمستندات Office الموجودة في Office XP أو الإصدارات الأحدث. 

في حالة تعطيل هذا النهج أو عدم تكوينه، يظهر جزء المعاينة تلقائيًا على يسار نتائج "بحث في سطح المكتب" ويمكن للمستخدمين من اختيار موقع جزء المعاينة</string>
      <string id="PreviewPaneLocation_Auto">تلقائي</string>
      <string id="PreviewPaneLocation_Right">يمين</string>
      <string id="PreviewPaneLocation_Bottom">أسفل</string>
      <string id="PreviewPaneLocation_Off">مغلق</string>
      <string id="SearchResultIconSize">تعيين عرض الرموز كبيرة أو صغيرة في نتائج "بحث في سطح المكتب"</string>
      <string id="SearchResultIconSize_Explain">يسمح تمكين هذا النهج بتحديد ما إذا كنت ترغب في عرض رموز كبيرة أو صغيرة لنتائج "بحث في سطح المكتب". الخياران هما:

- رموز كبيرة
- رموز صغيرة.

في حالة قيامك بتعطيل جزء المعاينة لأن المؤسسة لا تدعم Office XP أو الإصدارات الأحدث، يجب تطبيق عرض الرموز الكبيرة حتى يتمكن المستخدمون من رؤية الأجزاء المتعلقة باستعلام بحث سطح المكتب الخاص بهم.

في حالة تعطيل هذا النهج أو عدم تكوينه، يصبح عرض الرموز صغيرة افتراضيًا.</string>
      <string id="SearchResultIconSize_Small">رموز صغيرة</string>
      <string id="SearchResultIconSize_Large">رموز كبيرة</string>
      <string id="DisableWebSearch">عدم السماح بالبحث في الويب</string>
      <string id="DisableWebSearch_Explain">يعمل تمكين هذا النهج على إزالة خيار البحث في الويب من Windows Desktop Search. 

وفي حالة تعطيل هذا النهج أو عدم تكوينه، يتوفر خيار الويب ويمكن للمستخدمين البحث في الويب بواسطة محرك البحث في المستعرض الافتراضي لديهم.</string>
      <string id="StopIndexingOnLimitedHardDriveSpace">إيقاف الفهرسة في حالة المساحة المحددة لمحرك الأقراص الثابت</string>
      <string id="StopIndexingOnLimitedHardDriveSpace_Explain">يعمل تمكين هذا النهج على منع استمرار الفهرسة بعد تخصيص أقل من المقدار المحدد لمساحة محرك الأقراص الثابت على نفس محرك الأقراص كموقع للفهرس. اختر قيمة بين 0 و2147483647 ميغابايت. 

قم بتمكين هذا النهج إذا كانت مساحة محرك الأقراص الثابت لدي أجهزة الكمبيوتر في البيئة الخاصة بك محدودة للغاية. 

وفي حالة تعطيل هذا النهج أو عدم تكوينه، يقوم Windows Desktop Search بالتحكم في حجم الفهرس تلقائيًا.</string>
      <string id="StopIndexingOnLimitedHardDriveSpace_MBLimit">حد الميغا بايت</string>
      <string id="RichAttachmentPreviews">التحكم في معاينات منسقة للمرفقات</string>
      <string id="RichAttachmentPreviews_Explain">يعمل تمكين هذا النهج على تعريف قائمة مفصولة بفاصلة منقوطة لملحقات ملفات تسمح بإرفاق معاينات منسقة. 

 وفي حالة تعطيل هذا النهج أو عدم تكوينه، سوف يتم تعيين الإعدادات الافتراضية لملحقات الملفات التالية: .bmp;.emf;.gif;.jpg;.jpeg;.png;.wmf;.wrn;.txt;.err;.xml;.cpp;.c;.h;.cxx;.hxx;.idl;.cs;.vb;.idl;.xsd;.doc;.docx;.xls;.xlsx;.ppt;.pptx;.vsd;.xlsb;.xltx;.dot;.rtf</string>
      <string id="PreventUnwantedAddins">منع iFilters ومعالجات البروتوكولات غير المرغوب فيها</string>
      <string id="PreventUnwantedAddins_Explain">يعمل تمكين هذا النهج على منع Windows Desktop Search من استخدام iFilters ومعالجات البروتوكولات إذا لم يتم تحديدها في قائمة السماح. ومع ذلك لن يقوم هذا النهج بمنع تثبيت iFilters أو معالجات البروتوكول واستخدامهم بواسطة أية تطبيقات أو خدمات أخرى. 
يمكنك تحديد قائمة سماح لوظائف إضافية بواسطة توفير سلسلة المعرف البرمجي أو معرّف الفئة. على سبيل المثال، إذا كنت تخطط لنشر iFilter محدد، تأكد من توفره على قائمة السماح كمعرّف فريد عمومي مثل {xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx} (متضمنًا الأقواس الكبيرة) أو معرّف برمجي مثل VisFilter.CFilter.1.

في حالة احتفاظك ببيئة سطح مكتب مؤمنة، يعد هذا الإعداد بلا فائدة لأن جميع المستخدمين الإداريين لديهم إذن بتثبيت المكونات الجديدة. فإذا كان المستخدمون لديهم أذونات المسؤول أو يمكنهم تثبيت برنامج، يقوم هذا النهج بمنعهم من استخدام الوظائف الإضافية المتعلقة بـ Windows Desktop Search على وجه التحديد.

ملحوظة: بسبب تقييد محرر "نهج المجموعة"، يجب إضافة إدخال واحد على الأقل في قائمة السماح حتى لو كنت ترغب في تمكين هذا النهج بدون قائمة سماح. قم بإنشاء إدخال قائمة بوضع مساحة في حقل الاسم ومساحة في حقل القيمة ثم قم بحفظه. سوف يقوم هذا بإنشاء إدخال عنصر نائب يتم تجاهله بواسطة البرنامج.</string>
      <string id="PreventUnwantedAddins_AllowList">قائمة السماح</string>
      <string id="ExcludedExtensionsMultiline">منع فهرسة أنواع ملفات معينة</string>
      <string id="ExcludedExtensionsMultiline_Explain">يسمح تمكين هذا النهج بتحرير قائمة أنواع الملفات لاستثنائها من الفهرسة. فلا يتمكن المستخدم النهائي من تعديلها. يجب أن تقوم بفصل نوع الملحق بواسطة فاصلة منقوطة.

لاحظ أن حدود "محرر كائن نهج المجموعة" تتطلب أن يتم تقسيم هذه القائمة بقيم متعددة. ويقوم "بحث في سطح المكتب" بتجميع كافة هذه القيم في قائمة استثناء واحدة.

وفي حالة تعطيل هذا النهج أو عدم تكوينه، يمكن للمستخدم تحرير قائمة بأنواع الملفات المستثناة الافتراضية. أما في حالة تمكين هذا النهج ثم تعطيله، تتم استعادة القائمة الأصلية للمستخدم.

وإذا كنت ترغب في تحديد قائمة افتراضية أولية يمكن للمستخدمين تغييرها فيما بعد، راجع دليل الإدارة للحصول على معلومات حول إعداد تفضيل مبدئي للجهاز.</string>
      <string id="ExcludedExtensionsMultiline_0">استثناء</string>
      <string id="ExcludedExtensionsMultiline_1">و</string>
      <string id="ExcludedExtensionsMultiline_2">و</string>
      <string id="ExcludedExtensionsMultiline_3">و</string>
    </stringTable>
    <presentationTable>
      <presentation id="RichAttachmentPreviews">
        <textBox refId="RichAttachmentPreviews">
          <label>التحكم في معاينات منسقة للمرفقات</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="DataDirectory">
        <textBox refId="PartDataDirectory">
          <label>مسار (تحت 128 حرفًا):</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="AddPrimaryIntranetSearchScope">
        <textBox refId="PrimaryIntranetSearchScopeUrl">
          <label>عنوان Url لنطاق بحث الإنترانت</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="AddSecondaryIntranetSearchScope">
        <textBox refId="SecondaryIntranetSearchScopeUrl">
          <label>عنوان Url لنطاق بحث الإنترانت</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="PreviewPaneLocation">
        <dropdownList refId="PreviewPaneLocation" defaultItem="0">موقع جزء المعاينة</dropdownList>
      </presentation>
      <presentation id="SearchResultIconSize">
        <dropdownList refId="SearchResultIconSize" defaultItem="0">تعيين عرض الرموز كبيرة أو صغيرة في نتائج "بحث في سطح المكتب"</dropdownList>
      </presentation>
      <presentation id="StopIndexingOnLimitedHardDriveSpace">
        <decimalTextBox refId="StopIndexingOnLimitedHardDriveSpace_MBLimit">حد الميغا بايت</decimalTextBox>
      </presentation>      
      <presentation id="EnableThrottlingOnlineMailboxes">
        <decimalTextBox refId="LimitEnableThrottlingOnlineMailboxes" defaultValue="120">عدد العناصر في الدقيقة</decimalTextBox>
      </presentation>
      <presentation id="PreventUnwantedAddins">
        <listBox refId="PreventUnwantedAddins_AllowList">قائمة السماح</listBox>
      </presentation>
      <presentation id="PreventIndexingCertainPaths_1">
        <listBox refId="PreventIndexingCertainPaths">منع فهرسة مسارات معينة</listBox>
      </presentation>
      <presentation id="PreventIndexingCertainPaths_2">
        <listBox refId="PreventIndexingCertainPaths">منع فهرسة مسارات معينة</listBox>
      </presentation>
      <presentation id="DefaultIndexedPaths_1">
        <listBox refId="DefaultIndexedPaths">مسارات مفهرسة افتراضيًَا</listBox>
      </presentation>
      <presentation id="DefaultIndexedPaths_2">
        <listBox refId="DefaultIndexedPaths">مسارات مفهرسة افتراضيًَا</listBox>
      </presentation>
      <presentation id="DefaultExcludedPaths_1">
        <listBox refId="DefaultExcludedPaths">مسارات مستثناة افتراضيًا</listBox>
      </presentation>
      <presentation id="DefaultExcludedPaths_2">
        <listBox refId="DefaultExcludedPaths">مسارات مستثناة افتراضيًا</listBox>
      </presentation>
      <presentation id="ExcludedExtensionsMultiline">
        <textBox refId="ExcludedExtensionsMultiline_0">
          <label>استثناء</label>
          <defaultValue>.386;.aps;.bin;.bk1;.bk2;.bkf;.blf;.bsc;.btr;.cat;.cfg;.cgm;.chk;.ci;.crwl;.cur;.dat;.dbg;.dct;.dir;.dl_;.el;.evt;.ex_;.exp;.eyb;.fnt;.fon;.ghi;.gthr;.hqx;.icm;.idb;.idx;.ilk;.imc;.in_;.inl;.inv</defaultValue>
        </textBox>
        <textBox refId="ExcludedExtensionsMultiline_1">
          <label>و</label>
          <defaultValue>.ipp;.jbf;.lib;.local;.log;.log1;.log2;.m14;.mac;.man;.manifest;.map;.MAPIMail;.mmf;.mui;.muimanifest;.mv;.ncb;.obj;.oc_;.ocx;.onecache;.onetoc;.onetoc2;.ost;.pch;.pdb;.pds;.pf;.pic;.pma;.pmc;.pml</defaultValue>
        </textBox>
        <textBox refId="ExcludedExtensionsMultiline_2">
          <label>و</label>
          <defaultValue>.pmr;.pst;.res;.rmp;.rpc;.rsp;.sbr;.sc2;.sit;.sr_;.sy_;.sym;.TMCONTAINER00000000000000000001;.tlb;.tlh;.tmf;.tmp;.ttc;.ttf;.ttx;.TMCONTAINER00000000000000000002;.ufm;.vbx;.vxd;.wll;.wlt;.xbm;.xix;.z96;.ZFSendToTarget</defaultValue>
        </textBox>
        <textBox refId="ExcludedExtensionsMultiline_3">
          <label>و</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
